Tekla Open API Reference for Tekla Structures 2025
BooleanFilterExpression Methods
The BooleanFilterExpression type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
BooleanFilterExpression Class
Tekla.Structures.Filtering Namespace